module.exports = {
  semi: true, // Додає крапку з комою наприкінці кожного рядка
  singleQuote: true, // Використовує одинарні лапки замість подвійних
  trailingComma: "all", // Додає кому в кінці масивів, об'єктів тощо
  tabWidth: 2, // Розмір табуляції в пробілах
  useTabs: false, // Використовує пробіли замість табуляцій
  bracketSpacing: true, // Додає пробіл між дужками в об'єктах ({ foo: bar } замість {foo: bar})
  arrowParens: "always", // Завжди обгортає параметри стрілочних функцій в дужки (x) => x
  printWidth: 80, // Ліміт символів в рядку, переносить довгі рядки
  endOfLine: "lf", // Використовує Unix-стиль кінця рядка (\n)
};
